Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/usbhs.h
/*
 * Component description for USBHS
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-04-05T13:26:38Z */
#ifndef _PIC32CKGC01_USBHS_COMPONENT_H_
#define _PIC32CKGC01_USBHS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR USBHS                                        */
/* ************************************************************************** */

/* -------- USBHS_DMACNTL : (USBHS Offset: 0x00) (R/W 32) DMA Transfer Control For Each Channel -------- */
#define USBHS_DMACNTL_RESETVALUE              _UINT32_(0x00)                                       /*  (USBHS_DMACNTL) DMA Transfer Control For Each Channel  Reset Value */

#define USBHS_DMACNTL_DMAEN_Pos               _UINT32_(0)                                          /* (USBHS_DMACNTL) dma transfer enable Position */
#define USBHS_DMACNTL_DMAEN_Msk               (_UINT32_(0x1) << USBHS_DMACNTL_DMAEN_Pos)           /* (USBHS_DMACNTL) dma transfer enable Mask */
#define USBHS_DMACNTL_DMAEN(value)            (USBHS_DMACNTL_DMAEN_Msk & (_UINT32_(value) << USBHS_DMACNTL_DMAEN_Pos)) /* Assigment of value for DMAEN in the USBHS_DMACNTL register */
#define USBHS_DMACNTL_DMADIR_Pos              _UINT32_(1)                                          /* (USBHS_DMACNTL) transfer direction Position */
#define USBHS_DMACNTL_DMADIR_Msk              (_UINT32_(0x1) << USBHS_DMACNTL_DMADIR_Pos)          /* (USBHS_DMACNTL) transfer direction Mask */
#define USBHS_DMACNTL_DMADIR(value)           (USBHS_DMACNTL_DMADIR_Msk & (_UINT32_(value) << USBHS_DMACNTL_DMADIR_Pos)) /* Assigment of value for DMADIR in the USBHS_DMACNTL register */
#define   USBHS_DMACNTL_DMADIR_WRITE_Val      _UINT32_(0x0)                                        /* (USBHS_DMACNTL) DMA Write (RX Endpoint)  */
#define   USBHS_DMACNTL_DMADIR_READ_Val       _UINT32_(0x1)                                        /* (USBHS_DMACNTL) DMA Read (TX Endpoint)  */
#define USBHS_DMACNTL_DMADIR_WRITE            (USBHS_DMACNTL_DMADIR_WRITE_Val << USBHS_DMACNTL_DMADIR_Pos) /* (USBHS_DMACNTL) DMA Write (RX Endpoint) Position  */
#define USBHS_DMACNTL_DMADIR_READ             (USBHS_DMACNTL_DMADIR_READ_Val << USBHS_DMACNTL_DMADIR_Pos) /* (USBHS_DMACNTL) DMA Read (TX Endpoint) Position  */
#define USBHS_DMACNTL_DMAMODE_Pos             _UINT32_(2)                                          /* (USBHS_DMACNTL) transfer mode Position */
#define USBHS_DMACNTL_DMAMODE_Msk             (_UINT32_(0x1) << USBHS_DMACNTL_DMAMODE_Pos)         /* (USBHS_DMACNTL) transfer mode Mask */
#define USBHS_DMACNTL_DMAMODE(value)          (USBHS_DMACNTL_DMAMODE_Msk & (_UINT32_(value) << USBHS_DMACNTL_DMAMODE_Pos)) /* Assigment of value for DMAMODE in the USBHS_DMACNTL register */
#define   USBHS_DMACNTL_DMAMODE_MODE0_Val     _UINT32_(0x0)                                        /* (USBHS_DMACNTL) Mode 0 Transfer  */
#define   USBHS_DMACNTL_DMAMODE_MODE1_Val     _UINT32_(0x1)                                        /* (USBHS_DMACNTL) Mode1 Transfer  */
#define USBHS_DMACNTL_DMAMODE_MODE0           (USBHS_DMACNTL_DMAMODE_MODE0_Val << USBHS_DMACNTL_DMAMODE_Pos) /* (USBHS_DMACNTL) Mode 0 Transfer Position  */
#define USBHS_DMACNTL_DMAMODE_MODE1           (USBHS_DMACNTL_DMAMODE_MODE1_Val << USBHS_DMACNTL_DMAMODE_Pos) /* (USBHS_DMACNTL) Mode1 Transfer Position  */
#define USBHS_DMACNTL_DMAIE_Pos               _UINT32_(3)                                          /* (USBHS_DMACNTL) interrupt enable Position */
#define USBHS_DMACNTL_DMAIE_Msk               (_UINT32_(0x1) << USBHS_DMACNTL_DMAIE_Pos)           /* (USBHS_DMACNTL) interrupt enable Mask */
#define USBHS_DMACNTL_DMAIE(value)            (USBHS_DMACNTL_DMAIE_Msk & (_UINT32_(value) << USBHS_DMACNTL_DMAIE_Pos)) /* Assigment of value for DMAIE in the USBHS_DMACNTL register */
#define USBHS_DMACNTL_DMAEP_Pos               _UINT32_(4)                                          /* (USBHS_DMACNTL) endpoint number this channel is assigned to Position */
#define USBHS_DMACNTL_DMAEP_Msk               (_UINT32_(0xF) << USBHS_DMACNTL_DMAEP_Pos)           /* (USBHS_DMACNTL) endpoint number this channel is assigned to Mask */
#define USBHS_DMACNTL_DMAEP(value)            (USBHS_DMACNTL_DMAEP_Msk & (_UINT32_(value) << USBHS_DMACNTL_DMAEP_Pos)) /* Assigment of value for DMAEP in the USBHS_DMACNTL register */
#define USBHS_DMACNTL_DMAERR_Pos              _UINT32_(8)                                          /* (USBHS_DMACNTL) bus error bit Position */
#define USBHS_DMACNTL_DMAERR_Msk              (_UINT32_(0x1) << USBHS_DMACNTL_DMAERR_Pos)          /* (USBHS_DMACNTL) bus error bit Mask */
#define USBHS_DMACNTL_DMAERR(value)           (USBHS_DMACNTL_DMAERR_Msk & (_UINT32_(value) << USBHS_DMACNTL_DMAERR_Pos)) /* Assigment of value for DMAERR in the USBHS_DMACNTL register */
#define USBHS_DMACNTL_DMABRSTM_Pos            _UINT32_(9)                                          /* (USBHS_DMACNTL) burst mode Position */
#define USBHS_DMACNTL_DMABRSTM_Msk            (_UINT32_(0x3) << USBHS_DMACNTL_DMABRSTM_Pos)        /* (USBHS_DMACNTL) burst mode Mask */
#define USBHS_DMACNTL_DMABRSTM(value)         (USBHS_DMACNTL_DMABRSTM_Msk & (_UINT32_(value) << USBHS_DMACNTL_DMABRSTM_Pos)) /* Assigment of value for DMABRSTM in the USBHS_DMACNTL register */
#define   USBHS_DMACNTL_DMABRSTM_BM0_Val      _UINT32_(0x0)                                        /* (USBHS_DMACNTL) Burst Mode 0  */
#define   USBHS_DMACNTL_DMABRSTM_BM1_Val      _UINT32_(0x1)                                        /* (USBHS_DMACNTL) Burst Mode 1  */
#define   USBHS_DMACNTL_DMABRSTM_BM2_Val      _UINT32_(0x2)                                        /* (USBHS_DMACNTL) Burst Mode 2  */
#define   USBHS_DMACNTL_DMABRSTM_BM3_Val      _UINT32_(0x3)                                        /* (USBHS_DMACNTL) Burst Mode 3  */
#define USBHS_DMACNTL_DMABRSTM_BM0            (USBHS_DMACNTL_DMABRSTM_BM0_Val << USBHS_DMACNTL_DMABRSTM_Pos) /* (USBHS_DMACNTL) Burst Mode 0 Position  */
#define USBHS_DMACNTL_DMABRSTM_BM1            (USBHS_DMACNTL_DMABRSTM_BM1_Val << USBHS_DMACNTL_DMABRSTM_Pos) /* (USBHS_DMACNTL) Burst Mode 1 Position  */
#define USBHS_DMACNTL_DMABRSTM_BM2            (USBHS_DMACNTL_DMABRSTM_BM2_Val << USBHS_DMACNTL_DMABRSTM_Pos) /* (USBHS_DMACNTL) Burst Mode 2 Position  */
#define USBHS_DMACNTL_DMABRSTM_BM3            (USBHS_DMACNTL_DMABRSTM_BM3_Val << USBHS_DMACNTL_DMABRSTM_Pos) /* (USBHS_DMACNTL) Burst Mode 3 Position  */
#define USBHS_DMACNTL_Msk                     _UINT32_(0x000007FF)                                 /* (USBHS_DMACNTL) Register Mask  */


/* -------- USBHS_DMAADDR : (USBHS Offset: 0x04) (R/W 32) Memory Address Of The Corresponding DMA Channel -------- */
#define USBHS_DMAADDR_RESETVALUE              _UINT32_(0x00)                                       /*  (USBHS_DMAADDR) Memory Address Of The Corresponding DMA Channel  Reset Value */

#define USBHS_DMAADDR_ADDR10_Pos              _UINT32_(0)                                          /* (USBHS_DMAADDR) Lower 2 bits of DMA memory address Position */
#define USBHS_DMAADDR_ADDR10_Msk              (_UINT32_(0x3) << USBHS_DMAADDR_ADDR10_Pos)          /* (USBHS_DMAADDR) Lower 2 bits of DMA memory address Mask */
#define USBHS_DMAADDR_ADDR10(value)           (USBHS_DMAADDR_ADDR10_Msk & (_UINT32_(value) << USBHS_DMAADDR_ADDR10_Pos)) /* Assigment of value for ADDR10 in the USBHS_DMAADDR register */
#define USBHS_DMAADDR_ADDR312_Pos             _UINT32_(2)                                          /* (USBHS_DMAADDR) upper 30 bits of address Position */
#define USBHS_DMAADDR_ADDR312_Msk             (_UINT32_(0x3FFFFFFF) << USBHS_DMAADDR_ADDR312_Pos)  /* (USBHS_DMAADDR) upper 30 bits of address Mask */
#define USBHS_DMAADDR_ADDR312(value)          (USBHS_DMAADDR_ADDR312_Msk & (_UINT32_(value) << USBHS_DMAADDR_ADDR312_Pos)) /* Assigment of value for ADDR312 in the USBHS_DMAADDR register */
#define USBHS_DMAADDR_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (USBHS_DMAADDR) Register Mask  */


/* -------- USBHS_DMACOUNT : (USBHS Offset: 0x08) (R/W 32) Current DMA Count Of The Transfer -------- */
#define USBHS_DMACOUNT_RESETVALUE             _UINT32_(0x00)                                       /*  (USBHS_DMACOUNT) Current DMA Count Of The Transfer  Reset Value */

#define USBHS_DMACOUNT_DMACOUNT_Pos           _UINT32_(0)                                          /* (USBHS_DMACOUNT) current dma count of the transfer Position */
#define USBHS_DMACOUNT_DMACOUNT_Msk           (_UINT32_(0xFFFFFFFF) << USBHS_DMACOUNT_DMACOUNT_Pos) /* (USBHS_DMACOUNT) current dma count of the transfer Mask */
#define USBHS_DMACOUNT_DMACOUNT(value)        (USBHS_DMACOUNT_DMACOUNT_Msk & (_UINT32_(value) << USBHS_DMACOUNT_DMACOUNT_Pos)) /* Assigment of value for DMACOUNT in the USBHS_DMACOUNT register */
#define USBHS_DMACOUNT_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (USBHS_DMACOUNT) Register Mask  */


/* -------- USBHS_TXFUNCADDREP : (USBHS Offset: 0x00) (R/W 8) Relevant In Host Mode Only. Address Of The Target Function. -------- */
#define USBHS_TXFUNCADDREP_RESETVALUE         _UINT8_(0x00)                                        /*  (USBHS_TXFUNCADDREP) Relevant In Host Mode Only. Address Of The Target Function.  Reset Value */

#define USBHS_TXFUNCADDREP_TXFUNCADDR_Pos     _UINT8_(0)                                           /* (USBHS_TXFUNCADDREP) address of the target function Position */
#define USBHS_TXFUNCADDREP_TXFUNCADDR_Msk     (_UINT8_(0x7F) << USBHS_TXFUNCADDREP_TXFUNCADDR_Pos) /* (USBHS_TXFUNCADDREP) address of the target function Mask */
#define USBHS_TXFUNCADDREP_TXFUNCADDR(value)  (USBHS_TXFUNCADDREP_TXFUNCADDR_Msk & (_UINT8_(value) << USBHS_TXFUNCADDREP_TXFUNCADDR_Pos)) /* Assigment of value for TXFUNCADDR in the USBHS_TXFUNCADDREP register */
#define USBHS_TXFUNCADDREP_Msk                _UINT8_(0x7F)                                        /* (USBHS_TXFUNCADDREP) Register Mask  */


