Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/usbhs.h
/* HOST_EPX mode */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_TXCSRH) When Read, This Bit Indicates The Current State Of The Endpoint Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Pos) /* (USBHS_ENDPOINTX_TXCSRH) When Read, This Bit Indicates The Current State Of The Endpoint Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLE_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DATATOGGLEWRENABLE_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Select DMA Request Mode Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Select DMA Request Mode Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQMODE_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packe Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packe Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_FRCDATATOG_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_DMAREQENAB_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_TXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum P Position */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Pos) /* (USBHS_ENDPOINTX_TXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum P Mask */
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET(value) (USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_HOST_EPX_AUTOSET_Pos))
#define USBHS_ENDPOINTX_TXCSRH_HOST_EPX_Msk   _UINT8_(0x9F)                                         /* (USBHS_ENDPOINTX_TXCSRH_HOST_EPX) Register Mask  */

/* PERIPHERAL_EPX mode */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Select DMA Request Mode 1 And Clears It To Select DMA Request Mode 0. Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Select DMA Request Mode 1 And Clears It To Select DMA Request Mode 0. Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQMODE_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packet To Be Cleared From The FIFO. Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Force The Endpoint Data Toggle To Switch And The Data Packet To Be Cleared From The FIFO. Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_FRCDATATOG_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The DMA Request For The TX Endpoint Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The DMA Request For The TX Endpoint Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_DMAREQENAB_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The TX Endpoint For Isochronous Transfers Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Pos) /* (USBHS_ENDPOINTX_TXCSRH) The CPU Sets This Bit To Enable The TX Endpoint For Isochronous Transfers Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_ISO_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_TXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum Packet Size Is Loaded Into The TX FIFO. Position */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Pos) /* (USBHS_ENDPOINTX_TXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Set When Data Of The Maximum Packet Size Is Loaded Into The TX FIFO. Mask */
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET(value) (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_AUTOSET_Pos))
#define USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX_Msk _UINT8_(0xDC)                                         /* (USBHS_ENDPOINTX_TXCSRH_PERIPHERAL_EPX) Register Mask  */


