Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/usbhs.h
/* -------- USBHS_ENDPOINT0_CSR0H : (USBHS Offset: 0x1013) (R/W 8) ENDPOINT0 Additional Control And Status Bits For TX Endpoint 0 -------- */
#define USBHS_ENDPOINT0_CSR0H_RESETVALUE      _UINT8_(0x00)                                        /*  (USBHS_ENDPOINT0_CSR0H) ENDPOINT0 Additional Control And Status Bits For TX Endpoint 0  Reset Value */

#define USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Pos   _UINT8_(0)                                           /* (USBHS_ENDPOINT0_CSR0H) Flush The Next Packet To Be Transmitted/Read Position */
#define USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Msk   (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Pos) /* (USBHS_ENDPOINT0_CSR0H) Flush The Next Packet To Be Transmitted/Read Mask */
#define USBHS_ENDPOINT0_CSR0H_FLUSHFIFO(value) (USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0H_FLUSHFIFO_Pos)) /* Assigment of value for FLUSHFIFO in the USBHS_ENDPOINT0_CSR0H register */
#define USBHS_ENDPOINT0_CSR0H_Msk             _UINT8_(0x01)                                        /* (USBHS_ENDPOINT0_CSR0H) Register Mask  */

/* HOST_EP0 mode */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINT0_CSR0H) When Read, This Bit Indicates The Current State Of The Endpoint 0 Data Toggle Position */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Pos) /* (USBHS_ENDPOINT0_CSR0H) When Read, This Bit Indicates The Current State Of The Endpoint 0 Data Toggle Mask */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE(value) (USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLE_Pos))
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINT0_CSR0H) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Position */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Pos) /* (USBHS_ENDPOINT0_CSR0H) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Mask */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE(value) (USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DATATOGGLEWRTENABLE_Pos))
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINT0_CSR0H) The CPU Writes A 1 To This Bit To Instruct The Core Not To Issue PING Tokens In Data And Status Phases Of A High-Speed Control Transfer Position */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Msk (_UINT8_(0x1) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Pos) /* (USBHS_ENDPOINT0_CSR0H) The CPU Writes A 1 To This Bit To Instruct The Core Not To Issue PING Tokens In Data And Status Phases Of A High-Speed Control Transfer Mask */
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING(value) (USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Msk & (_UINT8_(value) << USBHS_ENDPOINT0_CSR0H_HOST_EP0_DISPING_Pos))
#define USBHS_ENDPOINT0_CSR0H_HOST_EP0_Msk    _UINT8_(0x0E)                                         /* (USBHS_ENDPOINT0_CSR0H_HOST_EP0) Register Mask  */

/* PERIPHERAL_EP0 mode */
#define USBHS_ENDPOINT0_CSR0H_PERIPHERAL_EP0_Msk _UINT8_(0x00)                                         /* (USBHS_ENDPOINT0_CSR0H_PERIPHERAL_EP0) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXMAXP : (USBHS Offset: 0x1014) (R/W 16) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected RX Endpoint In A Single Operation -------- */
#define USBHS_ENDPOINTX_RXMAXP_RESETVALUE     _UINT16_(0x00)                                       /*  (USBHS_ENDPOINTX_RXMAXP) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected RX Endpoint In A Single Operation  Reset Value */

#define USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Pos _UINT16_(0)                                          /* (USBHS_ENDPOINTX_RXMAXP) Maximum Payload/Transactions Position */
#define USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Msk (_UINT16_(0x7FF) << USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Pos) /* (USBHS_ENDPOINTX_RXMAXP) Maximum Payload/Transactions Mask */
#define USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD(value) (USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_RXMAXP_MAXPAYLOAD_Pos)) /* Assigment of value for MAXPAYLOAD in the USBHS_ENDPOINTX_RXMAXP register */
#define USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Pos _UINT16_(11)                                         /* (USBHS_ENDPOINTX_RXMAXP) Multiplier Value (m-1) Position */
#define USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Msk (_UINT16_(0x1F) << USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Pos) /* (USBHS_ENDPOINTX_RXMAXP) Multiplier Value (m-1) Mask */
#define USBHS_ENDPOINTX_RXMAXP_MULTIPLIER(value) (USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Msk & (_UINT16_(value) << USBHS_ENDPOINTX_RXMAXP_MULTIPLIER_Pos)) /* Assigment of value for MULTIPLIER in the USBHS_ENDPOINTX_RXMAXP register */
#define USBHS_ENDPOINTX_RXMAXP_Msk            _UINT16_(0xFFFF)                                     /* (USBHS_ENDPOINTX_RXMAXP) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXCSRL : (USBHS Offset: 0x1016) (R/W 8) ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15 -------- */
#define USBHS_ENDPOINTX_RXCSRL_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_RXCSRL) ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15  Reset Value */

#define USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Pos   _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When A Data Packet Has Been Received. Position */
#define USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Msk   (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When A Data Packet Has Been Received. Mask */
#define USBHS_ENDPOINTX_RXCSRL_RXPKTRDY(value) (USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_RXPKTRDY_Pos)) /* Assigment of value for RXPKTRDY in the USBHS_ENDPOINTX_RXCSRL register */
#define USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Pos  _UINT8_(4)                                           /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Flush The Next Packet To Be Read From The Endpoint Rx FIFO Position */
#define USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Msk  (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Flush The Next Packet To Be Read From The Endpoint Rx FIFO Mask */
#define USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO(value) (USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_FLUSHFIFO_Pos)) /* Assigment of value for FLUSHFIFO in the USBHS_ENDPOINTX_RXCSRL register */
#define USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0. Position */
#define USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Reset The Endpoint Data Toggle To 0. Mask */
#define USBHS_ENDPOINTX_RXCSRL_CLRDATATOG(value) (USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_CLRDATATOG_Pos)) /* Assigment of value for CLRDATATOG in the USBHS_ENDPOINTX_RXCSRL register */
#define USBHS_ENDPOINTX_RXCSRL_Msk            _UINT8_(0x91)                                        /* (USBHS_ENDPOINTX_RXCSRL) Register Mask  */

/* HOST_EPX mode */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When No More Packets Can Be Loaded Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When No More Packets Can Be Loaded Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_FIFOFULL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_RXCSRL) The USB Sets This Bit When 3 Attempts Have Been Made To Receive A Packet And No Data Packet Has Been Received. Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The USB Sets This Bit When 3 Attempts Have Been Made To Receive A Packet And No Data Packet Has Been Received. Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_ERROR_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error. Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error. Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_NAKTIMEOUT_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Request An IN Transaction. Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Request An IN Transaction. Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_REQPKT_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXCSRL) When A STALL Handshake Is Received, This Bit Is Set And An Interrupt Is Generated. Position */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) When A STALL Handshake Is Received, This Bit Is Set And An Interrupt Is Generated. Mask */
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL(value) (USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_HOST_EPX_RXSTALL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_HOST_EPX_Msk   _UINT8_(0x6E)                                         /* (USBHS_ENDPOINTX_RXCSRL_HOST_EPX) Register Mask  */

/* PERIPHERAL_EPX mode */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When No More Packets Can Be Loaded Into The Rx FIFO. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When No More Packets Can Be Loaded Into The Rx FIFO. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_FIFOFULL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set If An OUT Packet Cannot Be Loaded Into The Rx FIFO. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set If An OUT Packet Cannot Be Loaded Into The Rx FIFO. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_OVERRUN_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When RxPktRdy Is Set If The Data Packet Has A CRC Or Bit-stuff Error. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_DATAERROR_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Issue A STALL Handshake. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) The CPU Writes A 1 To This Bit To Issue A STALL Handshake. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENDSTALL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When A STALL Handshake Is Transmitted. Position */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos) /* (USBHS_ENDPOINTX_RXCSRL) This Bit Is Set When A STALL Handshake Is Transmitted. Mask */
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL(value) (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_SENTSTALL_Pos))
#define USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX_Msk _UINT8_(0x6E)                                         /* (USBHS_ENDPOINTX_RXCSRL_PERIPHERAL_EPX) Register Mask  */


/* -------- USBHS_ENDPOINTX_RXCSRH : (USBHS Offset: 0x1017) (R/W 8) ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15 -------- */
#define USBHS_ENDPOINTX_RXCSRH_RESETVALUE     _UINT8_(0x00)                                        /*  (USBHS_ENDPOINTX_RXCSRH) ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15  Reset Value */

#define USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Pos _UINT8_(3)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Select DMA Request Mode Position */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Select DMA Request Mode Mask */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQMODE(value) (USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_DMAREQMODE_Pos)) /* Assigment of value for DMAREQMODE in the USBHS_ENDPOINTX_RXCSRH register */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Pos _UINT8_(5)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint Position */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Enable The DMA Request For The RX Endpoint Mask */
#define USBHS_ENDPOINTX_RXCSRH_DMAREQENAB(value) (USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_DMAREQENAB_Pos)) /* Assigment of value for DMAREQENAB in the USBHS_ENDPOINTX_RXCSRH register */
#define USBHS_ENDPOINTX_RXCSRH_Msk            _UINT8_(0x28)                                        /* (USBHS_ENDPOINTX_RXCSRH) Register Mask  */

/* HOST_EPX mode */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXCSRH) This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Pos) /* (USBHS_ENDPOINTX_RXCSRH) This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_INCOMPRX_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Pos _UINT8_(1)                                           /* (USBHS_ENDPOINTX_RXCSRH) When Read, This Bit Indicates The Current State Of The Endpoint Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Pos) /* (USBHS_ENDPOINTX_RXCSRH) When Read, This Bit Indicates The Current State Of The Endpoint Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLE_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Pos _UINT8_(2)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_DATATOGGLEWRTENABLE_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_RXCSRH) Indicates A PID Error In The Received Packet Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Pos) /* (USBHS_ENDPOINTX_RXCSRH) Indicates A PID Error In The Received Packet Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_PIDERROR_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit, The ReqPkt Bit Will Be Automatically Set When The RxPktRdy Bit Is Cleared. Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Pos) /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit, The ReqPkt Bit Will Be Automatically Set When The RxPktRdy Bit Is Cleared. Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOREQ_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Cleared When A Packet Of RxMaxP Bytes Has Been Unloaded From The RX FIFO Position */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Pos) /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit, TxPktRdy Will Be Automatically Cleared When A Packet Of RxMaxP Bytes Has Been Unloaded From The RX FIFO Mask */
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR(value) (USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_HOST_EPX_AUTOCLEAR_Pos))
#define USBHS_ENDPOINTX_RXCSRH_HOST_EPX_Msk   _UINT8_(0xD7)                                         /* (USBHS_ENDPOINTX_RXCSRH_HOST_EPX) Register Mask  */

/* PERIPHERAL_EPX mode */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Pos _UINT8_(0)                                           /* (USBHS_ENDPOINTX_RXCSRH) This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Because Parts Of The Data Were Not Received. Position */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Pos) /* (USBHS_ENDPOINTX_RXCSRH) This Bit Is Set In A High-Bandwidth Isochronous/Interrupt Transfer If The Packet In The Rx FIFO Is Incomplete Because Parts Of The Data Were Not Received. Mask */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX(value) (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_INCOMPRX_Pos))
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Pos _UINT8_(4)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Disable The Sending Of NYET Handshakes Position */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Disable The Sending Of NYET Handshakes Mask */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET(value) (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_DISNYET_Pos))
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Pos _UINT8_(6)                                           /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Enable the RX Endpoint For Isochronous Transfers Position */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Pos) /* (USBHS_ENDPOINTX_RXCSRH) The CPU Sets This Bit To Enable the RX Endpoint For Isochronous Transfers Mask */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO(value) (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_ISO_Pos))
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Pos _UINT8_(7)                                           /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit Then The RxPktRdy Bit Will Be Automatically Cleared Whean A Packet Of RxMaxP Bytes Has Benn Unloaded Froim The Rx FIFO Position */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Msk (_UINT8_(0x1) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Pos) /* (USBHS_ENDPOINTX_RXCSRH) If The CPU Sets This Bit Then The RxPktRdy Bit Will Be Automatically Cleared Whean A Packet Of RxMaxP Bytes Has Benn Unloaded Froim The Rx FIFO Mask */
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR(value) (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Msk & (_UINT8_(value) << USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_AUTOCLEAR_Pos))
#define USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX_Msk _UINT8_(0xD1)                                         /* (USBHS_ENDPOINTX_RXCSRH_PERIPHERAL_EPX) Register Mask  */


