Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/usbhs.h
/* -------- USBHS_LPMFADDR : (USBHS Offset: 0x1365) (R/W 8) Function Address In LPM Payload -------- */
#define USBHS_LPMFADDR_RESETVALUE             _UINT8_(0x00)                                        /*  (USBHS_LPMFADDR) Function Address In LPM Payload  Reset Value */

#define USBHS_LPMFADDR_FUNCADDR_Pos           _UINT8_(0)                                           /* (USBHS_LPMFADDR) function address that will be placed in the LPM payload Position */
#define USBHS_LPMFADDR_FUNCADDR_Msk           (_UINT8_(0x7F) << USBHS_LPMFADDR_FUNCADDR_Pos)       /* (USBHS_LPMFADDR) function address that will be placed in the LPM payload Mask */
#define USBHS_LPMFADDR_FUNCADDR(value)        (USBHS_LPMFADDR_FUNCADDR_Msk & (_UINT8_(value) << USBHS_LPMFADDR_FUNCADDR_Pos)) /* Assigment of value for FUNCADDR in the USBHS_LPMFADDR register */
#define USBHS_LPMFADDR_Msk                    _UINT8_(0x7F)                                        /* (USBHS_LPMFADDR) Register Mask  */


/* -------- USBHS_PHY00 : (USBHS Offset: 0x1500) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY00_RESETVALUE                _UINT32_(0x19)                                       /*  (USBHS_PHY00) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY00_PREEMP_Pos                _UINT32_(0)                                          /* (USBHS_PHY00) enables pre-emphasis Position */
#define USBHS_PHY00_PREEMP_Msk                (_UINT32_(0x7) << USBHS_PHY00_PREEMP_Pos)            /* (USBHS_PHY00) enables pre-emphasis Mask */
#define USBHS_PHY00_PREEMP(value)             (USBHS_PHY00_PREEMP_Msk & (_UINT32_(value) << USBHS_PHY00_PREEMP_Pos)) /* Assigment of value for PREEMP in the USBHS_PHY00 register */
#define   USBHS_PHY00_PREEMP_SOFEOP_Val       _UINT32_(0x0)                                        /* (USBHS_PHY00) Enable pre-emphasis during SOF and EOP  */
#define   USBHS_PHY00_PREEMP_CHIRP_Val        _UINT32_(0x1)                                        /* (USBHS_PHY00) Enable pre-emphasis during chirp  */
#define   USBHS_PHY00_PREEMP_NONCHIRP_Val     _UINT32_(0x2)                                        /* (USBHS_PHY00) Enable pre-emphasis in non-chirp state  */
#define   USBHS_PHY00_PREEMP_ALWAYS_Val       _UINT32_(0x3)                                        /* (USBHS_PHY00) Always enable pre-emphasis  */
#define USBHS_PHY00_PREEMP_SOFEOP             (USBHS_PHY00_PREEMP_SOFEOP_Val << USBHS_PHY00_PREEMP_Pos) /* (USBHS_PHY00) Enable pre-emphasis during SOF and EOP Position  */
#define USBHS_PHY00_PREEMP_CHIRP              (USBHS_PHY00_PREEMP_CHIRP_Val << USBHS_PHY00_PREEMP_Pos) /* (USBHS_PHY00) Enable pre-emphasis during chirp Position  */
#define USBHS_PHY00_PREEMP_NONCHIRP           (USBHS_PHY00_PREEMP_NONCHIRP_Val << USBHS_PHY00_PREEMP_Pos) /* (USBHS_PHY00) Enable pre-emphasis in non-chirp state Position  */
#define USBHS_PHY00_PREEMP_ALWAYS             (USBHS_PHY00_PREEMP_ALWAYS_Val << USBHS_PHY00_PREEMP_Pos) /* (USBHS_PHY00) Always enable pre-emphasis Position  */
#define USBHS_PHY00_SLEWRATE_Pos              _UINT32_(3)                                          /* (USBHS_PHY00) adjust FS/LS slew rate Position */
#define USBHS_PHY00_SLEWRATE_Msk              (_UINT32_(0x3) << USBHS_PHY00_SLEWRATE_Pos)          /* (USBHS_PHY00) adjust FS/LS slew rate Mask */
#define USBHS_PHY00_SLEWRATE(value)           (USBHS_PHY00_SLEWRATE_Msk & (_UINT32_(value) << USBHS_PHY00_SLEWRATE_Pos)) /* Assigment of value for SLEWRATE in the USBHS_PHY00 register */
#define   USBHS_PHY00_SLEWRATE_HIGH_Val       _UINT32_(0x0)                                        /* (USBHS_PHY00) Highest slew rate  */
#define   USBHS_PHY00_SLEWRATE_MIDDLE0_Val    _UINT32_(0x1)                                        /* (USBHS_PHY00) Middle slew rate  */
#define   USBHS_PHY00_SLEWRATE_MIDDLE1_Val    _UINT32_(0x2)                                        /* (USBHS_PHY00) Middle slew rate  */
#define   USBHS_PHY00_SLEWRATE_SMALLEST_Val   _UINT32_(0x3)                                        /* (USBHS_PHY00) Smallest slew rate  */
#define USBHS_PHY00_SLEWRATE_HIGH             (USBHS_PHY00_SLEWRATE_HIGH_Val << USBHS_PHY00_SLEWRATE_Pos) /* (USBHS_PHY00) Highest slew rate Position  */
#define USBHS_PHY00_SLEWRATE_MIDDLE0          (USBHS_PHY00_SLEWRATE_MIDDLE0_Val << USBHS_PHY00_SLEWRATE_Pos) /* (USBHS_PHY00) Middle slew rate Position  */
#define USBHS_PHY00_SLEWRATE_MIDDLE1          (USBHS_PHY00_SLEWRATE_MIDDLE1_Val << USBHS_PHY00_SLEWRATE_Pos) /* (USBHS_PHY00) Middle slew rate Position  */
#define USBHS_PHY00_SLEWRATE_SMALLEST         (USBHS_PHY00_SLEWRATE_SMALLEST_Val << USBHS_PHY00_SLEWRATE_Pos) /* (USBHS_PHY00) Smallest slew rate Position  */
#define USBHS_PHY00_RXPHSSEL_Pos              _UINT32_(5)                                          /* (USBHS_PHY00) RX clock phase select Position */
#define USBHS_PHY00_RXPHSSEL_Msk              (_UINT32_(0x7) << USBHS_PHY00_RXPHSSEL_Pos)          /* (USBHS_PHY00) RX clock phase select Mask */
#define USBHS_PHY00_RXPHSSEL(value)           (USBHS_PHY00_RXPHSSEL_Msk & (_UINT32_(value) << USBHS_PHY00_RXPHSSEL_Pos)) /* Assigment of value for RXPHSSEL in the USBHS_PHY00 register */
#define   USBHS_PHY00_RXPHSSEL_EARLIEST_Val   _UINT32_(0x0)                                        /* (USBHS_PHY00) Earliest phase  */
#define   USBHS_PHY00_RXPHSSEL_LATEST_Val     _UINT32_(0x7)                                        /* (USBHS_PHY00) Latest phase  */
#define USBHS_PHY00_RXPHSSEL_EARLIEST         (USBHS_PHY00_RXPHSSEL_EARLIEST_Val << USBHS_PHY00_RXPHSSEL_Pos) /* (USBHS_PHY00) Earliest phase Position  */
#define USBHS_PHY00_RXPHSSEL_LATEST           (USBHS_PHY00_RXPHSSEL_LATEST_Val << USBHS_PHY00_RXPHSSEL_Pos) /* (USBHS_PHY00) Latest phase Position  */
#define USBHS_PHY00_Msk                       _UINT32_(0x000000FF)                                 /* (USBHS_PHY00) Register Mask  */


/* -------- USBHS_PHY04 : (USBHS Offset: 0x1504) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY04_RESETVALUE                _UINT32_(0x8F)                                       /*  (USBHS_PHY04) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY04_TXPHSSEL_Pos              _UINT32_(0)                                          /* (USBHS_PHY04) set the Tx clock phase select Position */
#define USBHS_PHY04_TXPHSSEL_Msk              (_UINT32_(0x3) << USBHS_PHY04_TXPHSSEL_Pos)          /* (USBHS_PHY04) set the Tx clock phase select Mask */
#define USBHS_PHY04_TXPHSSEL(value)           (USBHS_PHY04_TXPHSSEL_Msk & (_UINT32_(value) << USBHS_PHY04_TXPHSSEL_Pos)) /* Assigment of value for TXPHSSEL in the USBHS_PHY04 register */
#define USBHS_PHY04_RSVD_Pos                  _UINT32_(3)                                          /* (USBHS_PHY04) Reserved Position */
#define USBHS_PHY04_RSVD_Msk                  (_UINT32_(0x1) << USBHS_PHY04_RSVD_Pos)              /* (USBHS_PHY04) Reserved Mask */
#define USBHS_PHY04_RSVD(value)               (USBHS_PHY04_RSVD_Msk & (_UINT32_(value) << USBHS_PHY04_RSVD_Pos)) /* Assigment of value for RSVD in the USBHS_PHY04 register */
#define USBHS_PHY04_HIZ_Pos                   _UINT32_(4)                                          /* (USBHS_PHY04) Set D+/D- to a high impedence state Position */
#define USBHS_PHY04_HIZ_Msk                   (_UINT32_(0x1) << USBHS_PHY04_HIZ_Pos)               /* (USBHS_PHY04) Set D+/D- to a high impedence state Mask */
#define USBHS_PHY04_HIZ(value)                (USBHS_PHY04_HIZ_Msk & (_UINT32_(value) << USBHS_PHY04_HIZ_Pos)) /* Assigment of value for HIZ in the USBHS_PHY04 register */
#define USBHS_PHY04_SQUELCH210_Pos            _UINT32_(5)                                          /* (USBHS_PHY04) Lower 3 bits of RX squelch trigger point configuration Position */
#define USBHS_PHY04_SQUELCH210_Msk            (_UINT32_(0x7) << USBHS_PHY04_SQUELCH210_Pos)        /* (USBHS_PHY04) Lower 3 bits of RX squelch trigger point configuration Mask */
#define USBHS_PHY04_SQUELCH210(value)         (USBHS_PHY04_SQUELCH210_Msk & (_UINT32_(value) << USBHS_PHY04_SQUELCH210_Pos)) /* Assigment of value for SQUELCH210 in the USBHS_PHY04 register */
#define USBHS_PHY04_Msk                       _UINT32_(0x000000FB)                                 /* (USBHS_PHY04) Register Mask  */


/* -------- USBHS_PHY08 : (USBHS Offset: 0x1508) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY08_RESETVALUE                _UINT32_(0x07)                                       /*  (USBHS_PHY08) USBHPHY Control Register.  Reset Value */

