Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/usbhs.h
/* -------- USBHS_PHY4C : (USBHS Offset: 0x154C) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY4C_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_PHY4C) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY4C_VBUSVALTUNE_Pos           _UINT32_(0)                                          /* (USBHS_PHY4C) VBus_valid reference tuning Position */
#define USBHS_PHY4C_VBUSVALTUNE_Msk           (_UINT32_(0x7) << USBHS_PHY4C_VBUSVALTUNE_Pos)       /* (USBHS_PHY4C) VBus_valid reference tuning Mask */
#define USBHS_PHY4C_VBUSVALTUNE(value)        (USBHS_PHY4C_VBUSVALTUNE_Msk & (_UINT32_(value) << USBHS_PHY4C_VBUSVALTUNE_Pos)) /* Assigment of value for VBUSVALTUNE in the USBHS_PHY4C register */
#define USBHS_PHY4C_BSESSVALIDTUNE10_Pos      _UINT32_(6)                                          /* (USBHS_PHY4C) Lower 2 B_sessionvalid reference tune Position */
#define USBHS_PHY4C_BSESSVALIDTUNE10_Msk      (_UINT32_(0x3) << USBHS_PHY4C_BSESSVALIDTUNE10_Pos)  /* (USBHS_PHY4C) Lower 2 B_sessionvalid reference tune Mask */
#define USBHS_PHY4C_BSESSVALIDTUNE10(value)   (USBHS_PHY4C_BSESSVALIDTUNE10_Msk & (_UINT32_(value) << USBHS_PHY4C_BSESSVALIDTUNE10_Pos)) /* Assigment of value for BSESSVALIDTUNE10 in the USBHS_PHY4C register */
#define USBHS_PHY4C_Msk                       _UINT32_(0x000000C7)                                 /* (USBHS_PHY4C) Register Mask  */


/* -------- USBHS_PHY50 : (USBHS Offset: 0x1550) (R/W 32) USBHPHY Control Register. -------- */
#define USBHS_PHY50_RESETVALUE                _UINT32_(0x00)                                       /*  (USBHS_PHY50) USBHPHY Control Register.  Reset Value */

#define USBHS_PHY50_BSESSVALIDTUNE2_Pos       _UINT32_(0)                                          /* (USBHS_PHY50) MSB of B_sessionvalid reference tune Position */
#define USBHS_PHY50_BSESSVALIDTUNE2_Msk       (_UINT32_(0x1) << USBHS_PHY50_BSESSVALIDTUNE2_Pos)   /* (USBHS_PHY50) MSB of B_sessionvalid reference tune Mask */
#define USBHS_PHY50_BSESSVALIDTUNE2(value)    (USBHS_PHY50_BSESSVALIDTUNE2_Msk & (_UINT32_(value) << USBHS_PHY50_BSESSVALIDTUNE2_Pos)) /* Assigment of value for BSESSVALIDTUNE2 in the USBHS_PHY50 register */
#define USBHS_PHY50_ASESSVALIDTUNE_Pos        _UINT32_(1)                                          /* (USBHS_PHY50) A_sessionvalid reference tune Position */
#define USBHS_PHY50_ASESSVALIDTUNE_Msk        (_UINT32_(0x7) << USBHS_PHY50_ASESSVALIDTUNE_Pos)    /* (USBHS_PHY50) A_sessionvalid reference tune Mask */
#define USBHS_PHY50_ASESSVALIDTUNE(value)     (USBHS_PHY50_ASESSVALIDTUNE_Msk & (_UINT32_(value) << USBHS_PHY50_ASESSVALIDTUNE_Pos)) /* Assigment of value for ASESSVALIDTUNE in the USBHS_PHY50 register */
#define USBHS_PHY50_COMPCURREF_Pos            _UINT32_(5)                                          /* (USBHS_PHY50) Compensation current tuning reference Position */
#define USBHS_PHY50_COMPCURREF_Msk            (_UINT32_(0x7) << USBHS_PHY50_COMPCURREF_Pos)        /* (USBHS_PHY50) Compensation current tuning reference Mask */
#define USBHS_PHY50_COMPCURREF(value)         (USBHS_PHY50_COMPCURREF_Msk & (_UINT32_(value) << USBHS_PHY50_COMPCURREF_Pos)) /* Assigment of value for COMPCURREF in the USBHS_PHY50 register */
#define USBHS_PHY50_Msk                       _UINT32_(0x000000EF)                                 /* (USBHS_PHY50) Register Mask  */

#define USBHS_PHY50_BSESSVALIDTUNE_Pos        _UINT32_(0)                                          /* (USBHS_PHY50 Position) MSB of B_sessionvalid reference tune */
#define USBHS_PHY50_BSESSVALIDTUNE_Msk        (_UINT32_(0x1) << USBHS_PHY50_BSESSVALIDTUNE_Pos)    /* (USBHS_PHY50 Mask) BSESSVALIDTUNE */
#define USBHS_PHY50_BSESSVALIDTUNE(value)     (USBHS_PHY50_BSESSVALIDTUNE_Msk & (_UINT32_(value) << USBHS_PHY50_BSESSVALIDTUNE_Pos)) 

/** \brief USBHS register offsets definitions */
#define USBHS_DMACNTL_REG_OFST         _UINT32_(0x00)      /* (USBHS_DMACNTL) DMA Transfer Control For Each Channel Offset */
#define USBHS_DMAADDR_REG_OFST         _UINT32_(0x04)      /* (USBHS_DMAADDR) Memory Address Of The Corresponding DMA Channel Offset */
#define USBHS_DMACOUNT_REG_OFST        _UINT32_(0x08)      /* (USBHS_DMACOUNT) Current DMA Count Of The Transfer Offset */
#define USBHS_TXFUNCADDREP_REG_OFST    _UINT32_(0x00)      /* (USBHS_TXFUNCADDREP) Relevant In Host Mode Only. Address Of The Target Function. Offset */
#define USBHS_TXHUBADDREP_REG_OFST     _UINT32_(0x02)      /* (USBHS_TXHUBADDREP) Relevant In Host Mode Only. HUB Address Offset */
#define USBHS_TXHUBPORT_REG_OFST       _UINT32_(0x03)      /* (USBHS_TXHUBPORT) Relevant In Host Mode Only. HUB Address Offset */
#define USBHS_RXFUNCADDREP_REG_OFST    _UINT32_(0x04)      /* (USBHS_RXFUNCADDREP) Relevant In Host Mode Only. Address Of The Target Function. Offset */
#define USBHS_RXHUBADDREP_REG_OFST     _UINT32_(0x06)      /* (USBHS_RXHUBADDREP) Relevant In Host Mode Only. HUB Address Offset */
#define USBHS_RXHUBPORT_REG_OFST       _UINT32_(0x07)      /* (USBHS_RXHUBPORT) Relevant In Host Mode Only. HUB Address Offset */
#define USBHS_CTRLA_REG_OFST           _UINT32_(0x00)      /* (USBHS_CTRLA) USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected) Offset */
#define USBHS_CTRLB_REG_OFST           _UINT32_(0x04)      /* (USBHS_CTRLB) USBHS Control Register B Offset */
#define USBHS_CTRLC_REG_OFST           _UINT32_(0x08)      /* (USBHS_CTRLC) USBHS Control Register C Offset */
#define USBHS_INTENCLR_REG_OFST        _UINT32_(0x0C)      /* (USBHS_INTENCLR) USBHS Interrupt Enable Clear Register Offset */
#define USBHS_INTENSET_REG_OFST        _UINT32_(0x10)      /* (USBHS_INTENSET) USBHS Interrupt Enable Clear Register Offset */
#define USBHS_INTFLAG_REG_OFST         _UINT32_(0x14)      /* (USBHS_INTFLAG) USBHS Interrupt Flag Register Offset */
#define USBHS_STATUS_REG_OFST          _UINT32_(0x18)      /* (USBHS_STATUS) USBHS Status Register Offset */
#define USBHS_SYNCBUSY_REG_OFST        _UINT32_(0x1C)      /* (USBHS_SYNCBUSY) USBHS Syncbusy Register Offset */
#define USBHS_FADDR_REG_OFST           _UINT32_(0x1000)    /* (USBHS_FADDR) Function Address Register Offset */
#define USBHS_POWER_REG_OFST           _UINT32_(0x1001)    /* (USBHS_POWER) Used For Controlling Suspend And Resume Signaling And Some Basic Operation Of USBCORE Offset */
#define USBHS_INTRTX_REG_OFST          _UINT32_(0x1002)    /* (USBHS_INTRTX) Read Only Register Which Indicates Which Interrupts Are Currently Active For EP0 And TX EP1-15 Offset */
#define USBHS_INTRRX_REG_OFST          _UINT32_(0x1004)    /* (USBHS_INTRRX) Read Only Register Which Indicates Which Interrupts Are Currently Active For RX EP1-15 Offset */
#define USBHS_INTRTXE_REG_OFST         _UINT32_(0x1006)    /* (USBHS_INTRTXE) Interrupt Enable Bits for INTRTX Offset */
#define USBHS_INTRRXE_REG_OFST         _UINT32_(0x1008)    /* (USBHS_INTRRXE) Interrupt Enable Bits for INTRRX Offset */
#define USBHS_INTRUSB_REG_OFST         _UINT32_(0x100A)    /* (USBHS_INTRUSB) Read Only Register Which Indicates Which USB Interrupts Are Currently Active. Offset */
#define USBHS_INTRUSBE_REG_OFST        _UINT32_(0x100B)    /* (USBHS_INTRUSBE) Interrupt Enable Bits for USB Interrupts Offset */
#define USBHS_FRAME_REG_OFST           _UINT32_(0x100C)    /* (USBHS_FRAME) Holds The Last Received Frame Number Offset */
#define USBHS_INDEX_REG_OFST           _UINT32_(0x100E)    /* (USBHS_INDEX) Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed Offset */
#define USBHS_TESTMODE_REG_OFST        _UINT32_(0x100F)    /* (USBHS_TESTMODE) Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation Offset */
#define USBHS_ENDPOINTX_TXMAXP_REG_OFST _UINT32_(0x1010)    /* (USBHS_ENDPOINTX_TXMAXP) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected TX Endpoint In A Single Operation Offset */
#define USBHS_ENDPOINTX_TXCSRL_REG_OFST _UINT32_(0x1012)    /* (USBHS_ENDPOINTX_TXCSRL) ENDPOINTX Control And Status Bits for TX Endpoints 1-15 Offset */
#define USBHS_ENDPOINT0_CSR0L_REG_OFST _UINT32_(0x1012)    /* (USBHS_ENDPOINT0_CSR0L) ENDPOINT0 Control And Status Bits for TX Endpoint 0 Offset */
#define USBHS_ENDPOINTX_TXCSRH_REG_OFST _UINT32_(0x1013)    /* (USBHS_ENDPOINTX_TXCSRH) ENDPOINTX Additional Control And Status Bits For TX Endpoints 1-15 Offset */
#define USBHS_ENDPOINT0_CSR0H_REG_OFST _UINT32_(0x1013)    /* (USBHS_ENDPOINT0_CSR0H) ENDPOINT0 Additional Control And Status Bits For TX Endpoint 0 Offset */
#define USBHS_ENDPOINTX_RXMAXP_REG_OFST _UINT32_(0x1014)    /* (USBHS_ENDPOINTX_RXMAXP) ENDPOINTX Maximum Amount Of Data That Can Be Transferred Through The Selected RX Endpoint In A Single Operation Offset */
#define USBHS_ENDPOINTX_RXCSRL_REG_OFST _UINT32_(0x1016)    /* (USBHS_ENDPOINTX_RXCSRL) ENDPOINTX Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15 Offset */
#define USBHS_ENDPOINTX_RXCSRH_REG_OFST _UINT32_(0x1017)    /* (USBHS_ENDPOINTX_RXCSRH) ENDPOINTX Additional Control And Status Bits for RX Endpoint 0 Or Endpoint 1-15 Offset */
#define USBHS_ENDPOINTX_RXCOUNT_REG_OFST _UINT32_(0x1018)    /* (USBHS_ENDPOINTX_RXCOUNT) ENDPOINTX Number Of Data Bytes In The Packet Currently In Line To Be Read From The RX FIFO. Offset */
#define USBHS_ENDPOINT0_COUNT0_REG_OFST _UINT32_(0x1018)    /* (USBHS_ENDPOINT0_COUNT0) ENDPOINT0 Number Of Received Bytes In Endpoint 0 FIFO Offset */
#define USBHS_ENDPOINTX_TXTYPE_REG_OFST _UINT32_(0x101A)    /* (USBHS_ENDPOINTX_TXTYPE) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint Offset */
#define USBHS_ENDPOINT0_TYPE0_REG_OFST _UINT32_(0x101A)    /* (USBHS_ENDPOINT0_TYPE0) ENDPOINT0 Host Mode Only: Operating Speed Of The Targeted Device Offset */
#define USBHS_ENDPOINTX_TXINTERVAL_REG_OFST _UINT32_(0x101B)    /* (USBHS_ENDPOINTX_TXINTERVAL) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected TX Endpoint. Offset */
#define USBHS_ENDPOINT0_NAKLIMIT0_REG_OFST _UINT32_(0x101B)    /* (USBHS_ENDPOINT0_NAKLIMIT0) ENDPOINT0 Host Mode Only: Sets The NAK Response Timeout On Endpoint 0. Offset */
#define USBHS_ENDPOINTX_RXTYPE_REG_OFST _UINT32_(0x101C)    /* (USBHS_ENDPOINTX_RXTYPE) ENDPOINTX Host Mode Only: Should Be Written With The Endpoint Number To Be Targeted By The Endpoint Offset */
#define USBHS_ENDPOINTX_RXINTERVAL_REG_OFST _UINT32_(0x101D)    /* (USBHS_ENDPOINTX_RXINTERVAL) ENDPOINTX Host Mode Only: Defines The Polling Interval For The Currently Selected RX Endpoint. Offset */
#define USBHS_ENDPOINTX_FIFOSIZE_REG_OFST _UINT32_(0x101F)    /* (USBHS_ENDPOINTX_FIFOSIZE) ENDPOINTX Read Only Register That Returns The Sizes Of The FIFO's Associated With The Selected Additional TX/RX Endpoints. INDEX Regsiter should be set 1-15 Offset */
#define USBHS_ENDPOINT0_CONFIGDATA_REG_OFST _UINT32_(0x101F)    /* (USBHS_ENDPOINT0_CONFIGDATA) ENDPOINT0 Returns Information About The Selected Core Configuration. Only Applicable when INDEX Regsiter Is 0. That Is Endpoint0 Is Selected. Offset */
#define USBHS_FIFOX_REG_OFST           _UINT32_(0x1020)    /* (USBHS_FIFOX) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_FIFOX0_REG_OFST          _UINT32_(0x1020)    /* (USBHS_FIFOX0) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_FIFOX1_REG_OFST          _UINT32_(0x1024)    /* (USBHS_FIFOX1) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_FIFOX2_REG_OFST          _UINT32_(0x1028)    /* (USBHS_FIFOX2) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_FIFOX3_REG_OFST          _UINT32_(0x102C)    /* (USBHS_FIFOX3) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_FIFOX4_REG_OFST          _UINT32_(0x1030)    /* (USBHS_FIFOX4) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_FIFOX5_REG_OFST          _UINT32_(0x1034)    /* (USBHS_FIFOX5) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_FIFOX6_REG_OFST          _UINT32_(0x1038)    /* (USBHS_FIFOX6) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_FIFOX7_REG_OFST          _UINT32_(0x103C)    /* (USBHS_FIFOX7) Address Range Provides 16 Addresses For CPU Access To The FIFO's For Each Endpoint Offset */
#define USBHS_DEVCTL_REG_OFST          _UINT32_(0x1060)    /* (USBHS_DEVCTL) Selects Whether The Core Is Operating In Peripheral Or Host Mode Offset */
#define USBHS_MISC_REG_OFST            _UINT32_(0x1061)    /* (USBHS_MISC) RX/TX Early DMA Enable Bits Offset */
#define USBHS_TXFIFOSZ_REG_OFST        _UINT32_(0x1062)    /* (USBHS_TXFIFOSZ) Controls The Size Of The Selected TX Endpoint FIFO Offset */
#define USBHS_RXFIFOSZ_REG_OFST        _UINT32_(0x1063)    /* (USBHS_RXFIFOSZ) Controls The Size Of The Selected RX Endpoint FIFO Offset */
#define USBHS_TXFIFOADD_REG_OFST       _UINT32_(0x1064)    /* (USBHS_TXFIFOADD) Controls The Start Address Of the Selected TX Endpoint FIFO Offset */
#define USBHS_RXFIFOADD_REG_OFST       _UINT32_(0x1066)    /* (USBHS_RXFIFOADD) Controls The Start Address Of the Selected RX Endpoint FIFO Offset */
#define USBHS_EPINFO_REG_OFST          _UINT32_(0x1078)    /* (USBHS_EPINFO) Allows Read-Back Of The Number Of TX And RX Endpoints Offset */
#define USBHS_RAMINFO_REG_OFST         _UINT32_(0x1079)    /* (USBHS_RAMINFO) Details About Width Of RAM and DMA Channels Offset */
#define USBHS_LINKINFO_REG_OFST        _UINT32_(0x107A)    /* (USBHS_LINKINFO) Allows Some Delays To Be Specified Offset */
#define USBHS_VPLEN_REG_OFST           _UINT32_(0x107B)    /* (USBHS_VPLEN) Sets The Duration Of The VBus Pulsing Charge Offset */
#define USBHS_HSEOF1_REG_OFST          _UINT32_(0x107C)    /* (USBHS_HSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For HS Transactions Offset */
#define USBHS_FSEOF1_REG_OFST          _UINT32_(0x107D)    /* (USBHS_FSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For FS Transactions Offset */
#define USBHS_LSEOF1_REG_OFST          _UINT32_(0x107E)    /* (USBHS_LSEOF1) Sets The Minimum Time Gap That Is To Be Allowed Between The Start Of The Last Transaction And The EOF For LS Transactions Offset */
#define USBHS_SOFTRST_REG_OFST         _UINT32_(0x107F)    /* (USBHS_SOFTRST) Assert Low The Output Reset Signals NRSTO and NRSTXO Offset */
#define USBHS_DMAINTR_REG_OFST         _UINT32_(0x1200)    /* (USBHS_DMAINTR) DMA Interrupt Status for Each Channel Offset */
#define USBHS_RQPKTCOUNT_REG_OFST      _UINT32_(0x1304)    /* (USBHS_RQPKTCOUNT) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer Offset */
#define USBHS_RQPKTCOUNT0_REG_OFST     _UINT32_(0x1304)    /* (USBHS_RQPKTCOUNT0) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer Offset */
#define USBHS_RQPKTCOUNT1_REG_OFST     _UINT32_(0x1308)    /* (USBHS_RQPKTCOUNT1) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer Offset */
#define USBHS_RQPKTCOUNT2_REG_OFST     _UINT32_(0x130C)    /* (USBHS_RQPKTCOUNT2) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer Offset */
#define USBHS_RQPKTCOUNT3_REG_OFST     _UINT32_(0x1310)    /* (USBHS_RQPKTCOUNT3) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer Offset */
#define USBHS_RQPKTCOUNT4_REG_OFST     _UINT32_(0x1314)    /* (USBHS_RQPKTCOUNT4) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer Offset */
#define USBHS_RQPKTCOUNT5_REG_OFST     _UINT32_(0x1318)    /* (USBHS_RQPKTCOUNT5) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer Offset */
#define USBHS_RQPKTCOUNT6_REG_OFST     _UINT32_(0x131C)    /* (USBHS_RQPKTCOUNT6) Host Mode Only: Used To Specify Number Of Packets That Are To Be Transaferred In A Block Transfer Offset */
#define USBHS_RXDPKTBUFDIS_REG_OFST    _UINT32_(0x1340)    /* (USBHS_RXDPKTBUFDIS) Indicates Which Of The RX Endpoints Have Disabled Double Packet Buffer Functionality Offset */
#define USBHS_TXDPKTBUFDIS_REG_OFST    _UINT32_(0x1342)    /* (USBHS_TXDPKTBUFDIS) Indicates Which Of The TX Endpoints Have Disabled Double Packet Buffer Functionality Offset */
#define USBHS_CTUCH_REG_OFST           _UINT32_(0x1344)    /* (USBHS_CTUCH) Chirp Timeout. Number Of XCLK Cycles Before The Timeout Offset */
#define USBHS_CTHHSRTN_REG_OFST        _UINT32_(0x1346)    /* (USBHS_CTHHSRTN) Sets The Delay From The End Of High-Speed Resume Signaling (Acting As A Host) To Enable The UTM Normal Operating Mode Offset */
#define USBHS_CTHSBT_REG_OFST          _UINT32_(0x1348)    /* (USBHS_CTHSBT) This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times. Offset */
#define USBHS_LPMATTR_REG_OFST         _UINT32_(0x1360)    /* (USBHS_LPMATTR) Defines The Attributes Of An LPM Transaction And Sleep Cycle. Offset */
#define USBHS_LPMCNTRL_REG_OFST        _UINT32_(0x1362)    /* (USBHS_LPMCNTRL) LPM Control Register Offset */
#define USBHS_LPMINTREN_REG_OFST       _UINT32_(0x1363)    /* (USBHS_LPMINTREN) LPM Interrupts Enable Register Offset */
#define USBHS_LPMINTR_REG_OFST         _UINT32_(0x1364)    /* (USBHS_LPMINTR) Status Of The LPM Power State Offset */
#define USBHS_LPMFADDR_REG_OFST        _UINT32_(0x1365)    /* (USBHS_LPMFADDR) Function Address In LPM Payload Offset */
#define USBHS_PHY00_REG_OFST           _UINT32_(0x1500)    /* (USBHS_PHY00) USBHPHY Control Register. Offset */
#define USBHS_PHY04_REG_OFST           _UINT32_(0x1504)    /* (USBHS_PHY04) USBHPHY Control Register. Offset */
#define USBHS_PHY08_REG_OFST           _UINT32_(0x1508)    /* (USBHS_PHY08) USBHPHY Control Register. Offset */
#define USBHS_PHY0C_REG_OFST           _UINT32_(0x150C)    /* (USBHS_PHY0C) USBHPHY Control Register. Offset */
#define USBHS_PHY10_REG_OFST           _UINT32_(0x1510)    /* (USBHS_PHY10) USBHPHY Control Register. Offset */
#define USBHS_PHY14_REG_OFST           _UINT32_(0x1514)    /* (USBHS_PHY14) USBHPHY Control Register. Offset */
#define USBHS_PHY18_REG_OFST           _UINT32_(0x1518)    /* (USBHS_PHY18) USBHPHY Control Register. Offset */
#define USBHS_PHY1C_REG_OFST           _UINT32_(0x151C)    /* (USBHS_PHY1C) USBHPHY Control Register. Offset */
#define USBHS_PHY20_REG_OFST           _UINT32_(0x1520)    /* (USBHS_PHY20) USBHPHY Control Register. Offset */
#define USBHS_PHY24_REG_OFST           _UINT32_(0x1524)    /* (USBHS_PHY24) USBHPHY Control Register. Offset */
#define USBHS_PHY28_REG_OFST           _UINT32_(0x1528)    /* (USBHS_PHY28) USBHPHY Control Register. Offset */
#define USBHS_PHY44_REG_OFST           _UINT32_(0x1544)    /* (USBHS_PHY44) USBHPHY Control Register. Offset */
#define USBHS_PHY48_REG_OFST           _UINT32_(0x1548)    /* (USBHS_PHY48) USBHPHY Control Register. Offset */
#define USBHS_PHY4C_REG_OFST           _UINT32_(0x154C)    /* (USBHS_PHY4C) USBHPHY Control Register. Offset */
#define USBHS_PHY50_REG_OFST           _UINT32_(0x1550)    /* (USBHS_PHY50) USBHPHY Control Register. Offset */

